modules/admin/controllers/PostController.php

SELECT * FROM `post` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne(['id' => $id])) !== null) {

SELECT * FROM `category` WHERE 0=1
---
    public function actionSetCategory($id)
    {
        $post = $this->findModel($id);
        $selectedCategory = $post->category->id;
        $categories = ArrayHelper::map(Category::find()->all(), 'id', 'name');