models/Post.php

    public function saveImage($filename)
    {
        $this->image = $filename;
        return $this->save(false);
---
UPDATE `post` SET `image`='image.jpg' WHERE `id`=1

    public function getSelectedTag()
    {
        $selectedTag = $this->getTag()->select('id')->asArray()->all();
---
SELECT `id` FROM `tag` WHERE 0=1

    public function saveTag($tag)
    {
        if(is_array($tag))
        {
            $this->clearCurrentTag();

            foreach ($this as $tag_id)
            {
                $tag = Tag::findOne($tag_id);
---
SELECT * FROM `post_tag` WHERE `post_id`=1
SELECT * FROM `tag` WHERE `id`=1

    public function clearCurrentTag()
    {
        PostTag::deleteAll(['post_id'=>$this->id]);
---
DELETE FROM `post_tag` WHERE `post_id`=1